In [97]:
# Import dependencies and setup

import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as matplotlib
import matplotlib.dates as matplotlibdates
import datetime
from matplotlib.dates import date2num

In [98]:
# Read each dataset and store as DataFrame

elec_gen_fuel_type_path = "Resources/electricity_generation_fuel_type_state_territory.csv"
elec_fuel_df = pd.read_csv(elec_gen_fuel_type_path)

elec_gen_sector_path = "Resources/electricity_generation_sector_state_territory.csv"
elec_sector_df = pd.read_csv(elec_gen_sector_path)

energy_balance_path = "Resources/energy_balance.csv"
energy_balance_df = pd.read_csv(energy_balance_path)

energy_CIP_path = "Resources/energy_consumption_intensity_productivity.csv"
energy_CIP_df = pd.read_csv(energy_CIP_path)

energy_usage_path = "Resources/energy_use_state_territory.csv"
energy_usage_df = pd.read_csv(energy_usage_path)

exports_path = "Resources/exports_2019-2020.csv"
exports_df = pd.read_csv(exports_path)

fossil_fuels_path = "Resources/fossil_fuels.csv"
fossil_fuels_df = pd.read_csv(fossil_fuels_path)

imports_path = "Resources/imports_2019-2020.csv"
imports_df = pd.read_csv(imports_path)

renewables_path = "Resources/renewables.csv"
renewables_df = pd.read_csv(renewables_path)

In [99]:
# Preview elec_fuel_df

elec_fuel_df.head()
elec_fuel_df = elec_fuel_df.dropna(axis=1, how='all')
elec_fuel_df.head()

  State    Coal Natural Gas    Oil  Hydro Other Renewables
0   NSW  75.60%       2.80%  0.50%  3.50%           17.70%
1   VIC  67.70%       4.50%  0.40%  4.90%           22.50%
2   QLD  66.50%      16.30%  1.40%  0.90%           14.90%
3    WA  21.10%      61.70%  5.30%  0.40%           11.50%
4    SA   0.00%      40.80%  1.00%  0.10%           58.10%

In [100]:
# Preview elec_sector_df

elec_sector_df.head()

  State Electricity Sector Mining and Manufacturing Other Industries
0   NSW                94%                       1%               5%
1   VIC                92%                       2%               6%
2   QLD                87%                       6%               7%
3    WA                57%                      39%               5%
4    SA                85%                       3%              12%

In [101]:
# Preview energy_balance_df

energy_balance_df.head()

      Year  Production  Consumption  Net Exports  Yearly Total
0  1979–80      3802.7       3131.4        803.7        7737.8
1  1980–81      4193.8       3146.3        937.3        8277.4
2  1981–82      4380.8       3237.6        922.2        8540.6
3  1982–83      4552.8       3122.7       1208.1        8883.6
4  1983–84      4911.2       3221.2       1712.1        9844.5

In [35]:
# Preview energy_CIP_df

energy_CIP_df.head()
energy_CIP_df = energy_CIP_df.dropna(axis=1, how='all')
energy_CIP_df.head()

      Year  GDP  Energy Consumption  Energy Intensity  Energy Productivity
0  1979–80  100                 100               100                  100
1  1980–81  103                 101                97                  103
2  1981–82  107                 103                97                  103
3  1982–83  104                 100                96                  105
4  1983–84  109                 103                94                  106

In [37]:
# Preview exports_df

exports_df.head()

              Source  Amount (PJ)
0               Coal        11088
1        Natural gas         4393
2  Crude oil and ORF          626
3                LPG          141
4    Refind products           42

In [38]:
# Preview fossil_fuels_df

fossil_fuels_df.head()

      Year    Coal     Oil    Gas  Renewables
0  1974–75   981.1  1327.7  189.2       204.0
1  1975–76   981.2  1339.7  211.2       206.2
2  1976–77  1047.7  1410.6  256.2       199.3
3  1977–78  1070.4  1438.3  283.0       201.2
4  1978–79  1103.0  1440.9  314.9       199.6

In [39]:
# Preview imports_df

imports_df.head()

                 Source  Amount (PJ)
0       Refind products         1328
1     Crude oil and ORF          696
2                   LPG           21
3           Natural gas          180
4  Coal and by-products           19

In [40]:
# Preview renewables_df

renewables_df.head()

      Year  Hydro  Wind  Bioenergy  Solar
0  1994–95  16239     7        723     19
1  1995–96  15731     7        928     23
2  1996–97  16852     7        965     28
3  1997–98  15733     8       1029     34
4  1998–99  16563    28       1133     38

In [60]:
# Statistical analysis – energy_balance_df
# Calculate 'Production' total

energy_balance_prod_total = energy_balance_df['Production'].sum()
energy_balance_prod_total

433338.49999999994

In [61]:
# Calculate 'Consumption' total

energy_balance_cons_total = energy_balance_df['Consumption'].sum()
energy_balance_cons_total

196544.8

In [62]:
# Calculate 'Net Exports' total

energy_balance_net_exports_total = energy_balance_df['Net Exports'].sum()
energy_balance_net_exports_total

237592.09999999998

In [67]:
# Calculate cumulative totals and add to DataFrame

energy_balance_df['Production Cumulative'] = energy_balance_df['Production'].cumsum()
energy_balance_df['Consumption Cumulative'] = energy_balance_df['Consumption'].cumsum()
energy_balance_df['Net Exports Cumulative'] = energy_balance_df['Net Exports'].cumsum()
energy_balance_df.head()

,Year,Production,Consumption,Net Exports,Production Cumulative,Consumption Cumulative,Net Exports Cumulative
0,1979–80,3802.7,3131.4,803.7,3802.7,3131.4,803.7
1,1980–81,4193.8,3146.3,937.3,7996.5,6277.7,1741.0
2,1981–82,4380.8,3237.6,922.2,12377.3,9515.3,2663.2
3,1982–83,4552.8,3122.7,1208.1,16930.1,12638.0,3871.3
4,1983–84,4911.2,3221.2,1712.1,21841.3,15859.2,5583.4

In [88]:
# Statistical analysis – exports_balance_df
# Calculate 'Amount (PJ)' total

exports_amount_total = exports_df['Amount (PJ)'].sum() - 16290
exports_amount_total

16290

In [76]:
# Statistical analysis – fossil_fuels_df
# Calculate 'Coal' total

fossil_fuels_coal_totals = fossil_fuels_df['Coal'].sum()
fossil_fuels_coal_totals

79134.6

In [78]:
# Calculate 'Oil' total

fossil_fuels_coal_totals = fossil_fuels_df['Oil'].sum()
fossil_fuels_coal_totals

79530.6

In [79]:
# Calculate 'Gas' total

fossil_fuels_gas_totals = fossil_fuels_df['Gas'].sum()
fossil_fuels_gas_totals

40142.4

In [80]:
# Calculate 'Renewables' total

fossil_fuels_renewables_totals = fossil_fuels_df['Renewables'].sum()
fossil_fuels_renewables_totals

12223.900000000003

In [83]:
# Calculate cumulative totals and add to DataFrame

fossil_fuels_df['Coal Cumulative'] = fossil_fuels_df['Coal'].cumsum()
fossil_fuels_df['Oil Cumulative'] = fossil_fuels_df['Oil'].cumsum()
fossil_fuels_df['Gas Cumulative'] = fossil_fuels_df['Gas'].cumsum()
fossil_fuels_df['Renewables Cumulative'] = fossil_fuels_df['Renewables'].cumsum()
fossil_fuels_df.head()

,Year,Coal,Oil,Gas,Renewables,Coal Cumulative,Oil Cumulative,Gas Cumulative,Renewables Cumulative
0,1974–75,981.1,1327.7,189.2,204.0,981.1,1327.7,189.2,204.0
1,1975–76,981.2,1339.7,211.2,206.2,1962.3,2667.4,400.4,410.2
2,1976–77,1047.7,1410.6,256.2,199.3,3010.0,4078.0,656.6,609.5
3,1977–78,1070.4,1438.3,283.0,201.2,4080.4,5516.3,939.6,810.7
4,1978–79,1103.0,1440.9,314.9,199.6,5183.4,6957.2,1254.5,1010.3

In [89]:
# Statistical analysis – imports_balance_df
# Calculate 'Amount (PJ)' total

imports_amount_total = imports_df['Amount (PJ)'].sum()
imports_amount_total

4488

In [90]:
# Statistical analysis – renewables_balance_df
# Calculate 'Hydro' total

renewables_hydro_total = renewables_df['Hydro'].sum()
renewables_hydro_total

407046

In [91]:
# Calculate 'Wind' total

renewables_wind_total = renewables_df['Wind'].sum()
renewables_wind_total

140088

In [93]:
# Calculate 'Bioenergy' total

renewables_bioenergy_total = renewables_df['Bioenergy'].sum()
renewables_bioenergy_total

65791

In [94]:
# Calculate 'Solar' total

renewables_solar_total = renewables_df['Solar'].sum()
renewables_solar_total

79988

In [96]:
# Calculate cumulative totals and add to DataFrame

renewables_df['Hydro Cumulative'] = renewables_df['Hydro'].cumsum()
renewables_df['Wind Cumulative'] = renewables_df['Wind'].cumsum()
renewables_df['Bioenergy Cumulative'] = renewables_df['Bioenergy'].cumsum()
renewables_df['Solar Cumulative'] = renewables_df['Solar'].cumsum()
renewables_df

,Year,Hydro,Wind,Bioenergy,Solar,Hydro Cumulative,Wind Cumulative,Bioenergy Cumulative,Solar Cumulative
0,1994–95,16239,7,723,19,16239,7,723,19
1,1995–96,15731,7,928,23,31970,14,1651,42
2,1996–97,16852,7,965,28,48822,21,2616,70
3,1997–98,15733,8,1029,34,64555,29,3645,104
4,1998–99,16563,28,1133,38,81118,57,4778,142
5,1999–00,16720,58,1134,44,97838,115,5912,186
6,2000–01,16933,210,645,50,114771,325,6557,236
7,2001–02,16054,364,950,58,130825,689,7507,294
8,2002–03,16490,703,1584,58,147315,1392,9091,352
9,2003–04,16331,705,1800,69,163646,2097,10891,421
10,2004–05,15612,885,3830,78,179258,2982,14721,499
11,2005–06,16029,1713,3911,91,195287,4695,18632,590
12,2006–07,14517,2611,3953,105,209804,7306,22585,695
13,2007–08,12057,3093,4596,123,221861,10399,27181,818
14,2008–09,11869,3824,2795,156,233730,14223,29976,974
15,2009–10,13549,5052,2777,425,247279,19275,32753,1399
16,2010–11,16807,6085,2102,1531,264086,25360,34855,2930
17,2011–12,14083,6970,3044,2559,278169,32330,37899,5489
18,2012–13,18270,7960,3144,3827,296439,40290,41043,9316
19,2013–14,18421,10252,3499,4417,314860,50542,44542,13733
20,2014–15,13445,11467,3592,5532,328305,62009,48134,19265
21,2015–16,15318,12200,3790,6839,343623,74209,51924,26104
22,2016–17,16285,12597,3501,8072,359908,86806,55425,34176
23,2017–18,16021,15174,3518,9930,375929,101980,58943,44106
24,2018–19,15967,17712,3496,14849,391896,119692,62439,58955
25,2019–20,15150,20396,3352,21033,407046,140088,65791,79988